{
  "crunches": "1. Lie on your back with knees bent and feet flat on the floor.\n\n2. Place your hands behind your head.\n\n3. Lift your upper body towards your knees, then lower back down.",

  "reverse crunches": "1. Lie on your back with legs extended.\n\n2. Place your hands at your sides for support.\n\n3. Lift your legs off the floor and bring your knees towards your chest, then lower back down.",

  "elbow plank": "1. Start in a prone position.\n\n2. Place your forearms on the ground, elbows directly beneath your shoulders.\n\n3. Lift your body, keeping it straight from head to heels, and hold.",

  "full plank": "1. Start in a prone position.\n\n2. Place your hands directly under your shoulders.\n\n3. Lift your body, keeping it straight from head to heels, and hold.",

  "side plank": "1. Lie on your side with legs extended.\n\n2. Place your elbow directly beneath your shoulder.\n\n3. Lift your hips, keeping your body in a straight line from head to heels, and hold.",

  "russian twists": "1. Sit on the ground with knees bent and feet lifted.\n\n2. Lean back slightly and clasp your hands together.\n\n3. Twist your torso to move your hands from side to side.",

  "flutter kicks": "1. Lie on your back with legs extended.\n\n2. Lift your legs a few inches off the ground.\n\n3. Quickly kick your legs up and down alternately.",

  "L-sit": "1. Sit on the ground with legs extended.\n\n2. Place your hands on the ground beside your hips (or grab paralettes).\n\n3. Lift your body off the ground, keeping legs straight and parallel to the floor.",

  "leg raises": "1. Lie on your back with legs extended.\n\n2. Place your hands at your sides for support.\n\n3. Lift your legs up to a 90-degree angle, then lower back down.",

  "hanging knee raises": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Keep your body still and bring your knees towards your chest.\n\n3. Lower your knees back down.",

  "hanging leg raises": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Keep your body still and lift your legs up to a 90-degree angle.\n\n3. Lower your legs back down.",

  "push-ups": "1. Start in a full plank position with hands under shoulders.\n\n2. Lower your body until your chest nearly touches the ground.\n\n3. Push back up to the starting position.",

  "diamond push-ups": "1. Start in a high plank position with hands close together forming a diamond shape.\n\n2. Lower your body until your chest nearly touches your hands.\n\n3. Push back up to the starting position.",

  "narrow push-ups": "1. Start in a high plank position with hands closer than shoulder-width apart.\n\n2. Lower your body until your chest nearly touches the ground.\n\n3. Push back up to the starting position.",

  "wide push-ups": "1. Start in a high plank position with hands wider than shoulder-width apart.\n\n2. Lower your body until your chest nearly touches the ground.\n\n3. Push back up to the starting position.",

  "archer push-ups": "1. Start in a high plank position with hands as wide as you can.\n\n2. Lower your body towards one hand.\n\n3. Push back up and alternate sides.",

  "incline push-ups": "1. Place your hands on an elevated surface.\n\n2. Keep your body in a straight line and lower your chest towards the surface.\n\n3. Push back up to the starting position.",

  "decline push-ups": "1. Place your feet on an elevated surface.\n\n2. Keep your body in a straight line and lower your chest towards the ground.\n\n3. Push back up to the starting position.",

  "pike push-ups": "1. Start in a downward dog position.\n\n2. Lower your head towards the ground, bending your elbows.\n\n3. Push back up to the starting position.",

  "tiger push-ups": "1. Start in a forearm plank position.\n\n2. Push up onto your hands into a high plank.\n\n3. Lower back down to your forearms and repeat.",

  "dips": "1. Place your hands on parallel bars and lift your body.\n\n2. Lower your body by bending your elbows.\n\n3. Push back up to the starting position.",

  "chest flies": "1. Lie on a bench with a dumbbell in each hand.\n\n2. Extend your arms above your chest.\n\n3. Lower your arms out to the sides, then bring them back together.",

  "pull-ups": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Pull your body up until your chin is above the bar.\n\n3. Lower back down to the starting position.",

  "wide pull-ups": "1. Hang from a pull-up bar with a wide overhand grip.\n\n2. Pull your body up until your chin is above the bar.\n\n3. Lower back down to the starting position.",

  "narrow pull-ups": "1. Hang from a pull-up bar with a narrow overhand grip.\n\n2. Pull your body up until your chin is above the bar.\n\n3. Lower back down to the starting position.",

  "chin-ups": "1. Hang from a pull-up bar with an underhand grip.\n\n2. Pull your body up until your chin is above the bar.\n\n3. Lower back down to the starting position.",

  "dead hang": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Keep your body relaxed and hang freely.\n\n3. Hold this position for as long as possible.",

  "high pull-ups": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Pull your body up as high as possible, bringing your chest towards the bar.\n\n3. Lower back down to the starting position.",

  "muscle ups": "1. Hang from a pull-up bar with an overhand grip.\n\n2. Pull your body up and transition over the bar, pressing down to lift your torso above the bar.\n\n3. Lower back down to the starting position.",

  "lateral raises": "1. Stand with a dumbbell in each hand at your sides.\n\n2. Lift your arms out to the sides until they are shoulder height.\n\n3. Lower back down to the starting position.",

  "shoulder press": "1. Stand with a dumbbell in each hand at shoulder height.\n\n2. Press the dumbbells overhead until your arms are fully extended.\n\n3. Lower back down to the starting position.",

  "tricep dips": "1. Place your hands on a bench behind you and extend your legs.\n\n2. Lower your body by bending your elbows.\n\n3. Push back up to the starting position.",

  "bicep curls": "1. Stand with a dumbbell in each hand, arms at your sides.\n\n2. Curl the dumbbells up towards your shoulders.\n\n3. Lower back down to the starting position.",

  "hammer curls": "1. Stand with a dumbbell in each hand, arms at your sides, palms facing in.\n\n2. Curl the dumbbells up towards your shoulders.\n\n3. Lower back down to the starting position.",

  "squats": "1. Stand with feet shoulder-width apart.\n\n2. Lower your body by bending your knees and hips.\n\n3. Push back up to the starting position.",

  "mountain climbers": "1. Start in a high plank position.\n\n2. Bring one knee towards your chest, then quickly switch legs.\n\n3. Continue alternating legs at a fast pace.",

  "lunges": "1. Stand with feet together.\n\n2. Step forward with one leg and lower your body until both knees are bent at 90 degrees.\n\n3. Push back up to the starting position and switch legs.",

  "step-ups": "1. Stand in front of a bench or step.\n\n2. Step up with one foot, then bring the other foot up to meet it.\n\n3. Step back down and repeat on the other side.",

  "calf raises": "1. Stand with feet hip-width apart.\n\n2. Lift your heels off the ground as high as possible.\n\n3. Lower back down to the starting position.",

  "bulgarian squats": "1. Stand in front of a bench or step.\n\n2. Place one foot behind you on the bench.\n\n3. Lower your body by bending your front knee, then push back up.",

  "pistol squats": "1. Stand on one leg with the other leg extended forward.\n\n2. Lower your body by bending your standing leg.\n\n3. Push back up to the starting position and switch legs.",

  "frog stand": "1. Squat down and place your hands on the ground (or grab paralettes).\n\n2. Lean forward and lift your feet off the ground, balancing on your hands.\n\n3. Hold this position as long as possible.",

  "wall handstand": "1. Stand facing a wall and place your hands on the ground (or grab paralettes).\n\n2. Kick your legs up to brace yourself against the wall.",

  "body rows": "1. Find a low bar or railing at hip height.\n\n2. Lie under the bar and grip it shoulder-width apart.\n\n3. Lift your body, pulling your chest toward the bar.\n\n4. Lower yourself slowly back to the starting position."
}